-- This query must be the first one in this case.
-- SHOW command will be bypassed in resgroup, when it's the first command
-- in a connection it needs special handling to show memory_spill_ratio
-- correctly.  Verify that it shows the correct value 10 instead of default 20.
SHOW memory_spill_ratio;
 memory_spill_ratio 
--------------------
 10                 
(1 row)

--start_ignore
DROP ROLE role1_spill_test;
ERROR:  role "role1_spill_test" does not exist
DROP ROLE role2_spill_test;
ERROR:  role "role2_spill_test" does not exist
DROP RESOURCE GROUP rg1_spill_test;
ERROR:  resource group "rg1_spill_test" does not exist
DROP RESOURCE GROUP rg2_spill_test;
ERROR:  resource group "rg2_spill_test" does not exist
--end_ignore

CREATE RESOURCE GROUP rg1_spill_test WITH (CONCURRENCY=10, MEMORY_LIMIT=10, CPU_RATE_LIMIT=10, memory_shared_quota=20, memory_spill_ratio=30);
CREATE
CREATE RESOURCE GROUP rg2_spill_test WITH (CONCURRENCY=10, MEMORY_LIMIT=10, CPU_RATE_LIMIT=10, memory_shared_quota=50, memory_spill_ratio=10);
CREATE
CREATE ROLE role1_spill_test RESOURCE GROUP rg1_spill_test;
CREATE
CREATE ROLE role2_spill_test RESOURCE GROUP rg2_spill_test;
CREATE

-- positive set to resource group level
--start_ignore
SET ROLE role1_spill_test;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 30                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)
--end_ignore

-- positive set to session level
SET MEMORY_SPILL_RATIO TO 70;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 70                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- positive fallback to statement_mem at session level
SET MEMORY_SPILL_RATIO TO 0;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 0                  
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- negative set to session level
SET MEMORY_SPILL_RATIO TO 101;
ERROR:  101 is outside the valid range for parameter "memory_spill_ratio" (0 .. 100)
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 0                  
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- positive set to session level
SET MEMORY_SPILL_RATIO TO 90;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 90                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- positive set to session level
SET MEMORY_SPILL_RATIO TO 20;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 20                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- reset to resource group level
RESET MEMORY_SPILL_RATIO;
RESET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 30                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- positive set to session level
SET MEMORY_SPILL_RATIO TO 60;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 60                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- change role, positive for session level
SET ROLE role2_spill_test;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 60                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- positive set to session level
SET MEMORY_SPILL_RATIO TO 20;
SET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 20                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- reset to resource group level
RESET MEMORY_SPILL_RATIO;
RESET
SHOW MEMORY_SPILL_RATIO;
 memory_spill_ratio 
--------------------
 10                 
(1 row)
SELECT 1;
 ?column? 
----------
 1        
(1 row)

-- cleanup
RESET ROLE;
RESET
DROP ROLE role1_spill_test;
DROP
DROP ROLE role2_spill_test;
DROP
DROP RESOURCE GROUP rg1_spill_test;
DROP
DROP RESOURCE GROUP rg2_spill_test;
DROP
